app/graphql/queries/article_queries/fetch_article.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
            def resolve(id: ID)
                article = Article.find(id=id)