app/graphql/mutations/author_mutations/update_author.rb

            def resolve(id:, first_name: nil, last_name: nil)
                author = Author.find(id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]