app/graphql/types/article_type.rb

    def author
      return Author.find(id=object.author_id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def comments
      return Comment.all.select{ |comment| comment.article == object}
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"