app/graphql/types/author_type.rb

    def articles
      return Article.all.select { |article| article.author == object }
---
SELECT "articles".* FROM "articles"
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

    def comments
      return Comment.all.select { |comment| comment.author == object }
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"