app/graphql/queries/author_queries/fetch_author.rb

            def resolve(id: ID)
                author = Author.find(id=id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]