app/graphql/queries/comment_queries/fetch_comment.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
            def resolve(id:)
                comment = Comment.find(id=id)