app/graphql/mutations/comment_mutations/add_comment.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "author_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "This is a comment"], ["author_id", 7], ["article_id", 10], ["created_at", "2022-12-05 07:44:02.652379"], ["updated_at", "2022-12-05 07:44:02.652379"]]
---
            def resolve(content:, author_id:, article_id:)
                Author.find(id=author_id)
                Article.find(id=article_id)
                comment = Comment.create!(content: content,
                                          author_id: author_id,
                                          article_id: article_id)