app/graphql/mutations/comment_mutations/update_comment.rb

            def resolve(id:, content:)
                comment = Comment.find(id=id)
                comment.update!(content: content)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "This is a new comment"], ["updated_at", "2022-12-05 07:56:02.482774"], ["id", 26]]