app/graphql/mutations/article_mutations/update_article.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 70], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "new title"], ["body", "new content"], ["updated_at", "2022-12-05 06:59:04.469918"], ["id", 9]]
---
            def resolve(title:, body:, id:)
                article = Article.find(id=id)
                article.update!(title: title, body: body, id: id)